In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({
    "A":[" x", "y1 ", " z 90 ", 1.0],
    "B":["ab_ab_0", "c_d_a", np.nan, "g_h"],
    "C":["pre_hello", "pre_world", "pre_love", "pre_python"],
    "D":["1_x", "2_x", "3_x", "4_x"],
    "E":[1, 10, 34, 5689]
})
df

        A        B           C    D     E
0       x  ab_ab_0   pre_hello  1_x     1
1     y1     c_d_a   pre_world  2_x    10
2   z 90       NaN    pre_love  3_x    34
3     1.0      g_h  pre_python  4_x  5689

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      object
 1   B       3 non-null      object
 2   C       4 non-null      object
 3   D       4 non-null      object
 4   E       4 non-null      int64
dtypes: int64(1), object(4)
memory usage: 292.0+ bytes

In [6]:
type(df["A"][1])

str

In [8]:
df1 =df.astype("string")
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      string
 1   B       3 non-null      string
 2   C       4 non-null      string
 3   D       4 non-null      string
 4   E       4 non-null      string
dtypes: string(5)
memory usage: 292.0 bytes

In [9]:
df1 # <NA> formato de Pandas, funciona do mesmo jeito

        A        B           C    D     E
0       x  ab_ab_0   pre_hello  1_x     1
1     y1     c_d_a   pre_world  2_x    10
2   z 90      <NA>    pre_love  3_x    34
3     1.0      g_h  pre_python  4_x  5689

In [11]:
df1.A.str.capitalize() #chamar classe str para acessar medotos de str

0         x
1       Y1
2     z 90
3       1.0
Name: A, dtype: string

In [12]:
df.B.str.upper()

0    AB_AB_0
1      C_D_A
2        NaN
3        G_H
Name: B, dtype: object

In [13]:
df

        A        B           C    D     E
0       x  ab_ab_0   pre_hello  1_x     1
1     y1     c_d_a   pre_world  2_x    10
2   z 90       NaN    pre_love  3_x    34
3     1.0      g_h  pre_python  4_x  5689

In [14]:
#concatenation
df.B +df.D

0    ab_ab_01_x
1      c_d_a2_x
2           NaN
3        g_h4_x
dtype: object

In [17]:
df.B.str.cat(df.D)

0    ab_ab_01_x
1      c_d_a2_x
2           NaN
3        g_h4_x
Name: B, dtype: object

In [18]:
df

        A        B           C    D     E
0       x  ab_ab_0   pre_hello  1_x     1
1     y1     c_d_a   pre_world  2_x    10
2   z 90       NaN    pre_love  3_x    34
3     1.0      g_h  pre_python  4_x  5689

In [19]:
df.B.str.split("_")

0    [ab, ab, 0]
1      [c, d, a]
2            NaN
3         [g, h]
Name: B, dtype: object

In [20]:
df.B.str.split("_", expand=True)

     0    1     2
0   ab   ab     0
1    c    d     a
2  NaN  NaN   NaN
3    g    h  None

In [23]:
df1["B"] = df.B.str.replace("_", "-")
df1

        A        B           C    D     E
0       x  ab-ab-0   pre_hello  1_x     1
1     y1     c-d-a   pre_world  2_x    10
2   z 90       NaN    pre_love  3_x    34
3     1.0      g-h  pre_python  4_x  5689

In [25]:
df1.A.tolist()

[' x', 'y1 ', ' z 90 ', '1.0']

In [29]:
df1.A.str.strip().tolist()

['x', 'y1', 'z 90', '1.0']

In [35]:
df1.E.str.pad(width=4, side="left", fillchar="0")

0    0001
1    0010
2    0034
3    5689
Name: E, dtype: string

In [36]:
df1.E.str.pad(width=4, side="both", fillchar="-")

0    -1--
1    -10-
2    -34-
3    5689
Name: E, dtype: string

In [37]:
df1.E.str.zfill(width=4)

0    0001
1    0010
2    0034
3    5689
Name: E, dtype: string

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      object
 1   B       3 non-null      object
 2   C       4 non-null      object
 3   D       4 non-null      object
 4   E       4 non-null      int64
dtypes: int64(1), object(4)
memory usage: 292.0+ bytes

In [38]:
df.E.astype(str).str.zfill(width=4) # naofuciona em int

0    0001
1    0010
2    0034
3    5689
Name: E, dtype: object

In [40]:
df1

        A        B           C    D     E
0       x  ab-ab-0   pre_hello  1_x     1
1     y1     c-d-a   pre_world  2_x    10
2   z 90       NaN    pre_love  3_x    34
3     1.0      g-h  pre_python  4_x  5689

In [43]:
df1.E.str.removeprefix("pre_")

0       1
1      10
2      34
3    5689
Name: E, dtype: string

In [45]:
df1.D.str.removesuffix("_x")

0    1
1    2
2    3
3    4
Name: D, dtype: string

In [46]:
df1

        A        B           C    D     E
0       x  ab-ab-0   pre_hello  1_x     1
1     y1     c-d-a   pre_world  2_x    10
2   z 90       NaN    pre_love  3_x    34
3     1.0      g-h  pre_python  4_x  5689

In [47]:
df1.C.str.slice(0,5)

0    pre_h
1    pre_w
2    pre_l
3    pre_p
Name: C, dtype: string

In [48]:
df1.C.str.slice(-3)

0    llo
1    rld
2    ove
3    hon
Name: C, dtype: string

In [49]:
df1.B.str.len()

0    7.0
1    5.0
2    NaN
3    3.0
Name: B, dtype: float64

In [51]:
df1.B.str.count("a") # aceita regex

0    2.0
1    1.0
2    NaN
3    0.0
Name: B, dtype: float64